bench/data/redis-benchmark-machine-baseline.txt
====== SET ======
  10000 requests completed in 0.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.74% <= 0 milliseconds
46.91% <= 1 milliseconds
94.20% <= 2 milliseconds
99.05% <= 3 milliseconds
99.64% <= 4 milliseconds
99.68% <= 5 milliseconds
99.72% <= 6 milliseconds
99.76% <= 7 milliseconds
99.77% <= 8 milliseconds
99.81% <= 9 milliseconds
99.84% <= 10 milliseconds
99.89% <= 11 milliseconds
99.94% <= 12 milliseconds
99.95% <= 13 milliseconds
99.96% <= 14 milliseconds
100.00% <= 15 milliseconds
30581.04 requests per second

====== GET ======
  10016 requests completed in 0.34 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.54% <= 0 milliseconds
41.05% <= 1 milliseconds
92.98% <= 2 milliseconds
98.72% <= 3 milliseconds
99.43% <= 4 milliseconds
99.60% <= 5 milliseconds
99.80% <= 6 milliseconds
99.81% <= 10 milliseconds
99.82% <= 11 milliseconds
99.83% <= 13 milliseconds
99.84% <= 14 milliseconds
99.85% <= 15 milliseconds
99.90% <= 16 milliseconds
99.92% <= 17 milliseconds
99.93% <= 18 milliseconds
99.97% <= 20 milliseconds
100.00% <= 21 milliseconds
29031.88 requests per second

====== INCR ======
  10024 requests completed in 0.35 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.49% <= 0 milliseconds
40.18% <= 1 milliseconds
90.75% <= 2 milliseconds
99.02% <= 3 milliseconds
99.93% <= 4 milliseconds
99.95% <= 5 milliseconds
99.96% <= 6 milliseconds
100.00% <= 7 milliseconds
28640.00 requests per second

====== LPUSH ======
  10009 requests completed in 0.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.89% <= 0 milliseconds
45.39% <= 1 milliseconds
94.03% <= 2 milliseconds
99.51% <= 3 milliseconds
99.73% <= 4 milliseconds
99.74% <= 5 milliseconds
99.75% <= 6 milliseconds
99.77% <= 7 milliseconds
99.78% <= 8 milliseconds
99.86% <= 9 milliseconds
99.92% <= 10 milliseconds
99.94% <= 11 milliseconds
99.95% <= 12 milliseconds
99.98% <= 13 milliseconds
100.00% <= 16 milliseconds
29967.07 requests per second

====== LPOP ======
  10039 requests completed in 0.34 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.59% <= 0 milliseconds
39.95% <= 1 milliseconds
92.14% <= 2 milliseconds
99.22% <= 3 milliseconds
99.43% <= 4 milliseconds
99.84% <= 5 milliseconds
99.86% <= 6 milliseconds
99.92% <= 7 milliseconds
99.96% <= 8 milliseconds
100.00% <= 9 milliseconds
29098.55 requests per second

====== PING ======
  10015 requests completed in 0.31 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

1.21% <= 0 milliseconds
50.65% <= 1 milliseconds
95.96% <= 2 milliseconds
99.20% <= 3 milliseconds
99.38% <= 4 milliseconds
99.65% <= 5 milliseconds
99.95% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
31996.81 requests per second